class MyPageControllers {
    static renderMainPage(req, res) {
        res.render("index", {
            title: "Мій сайт",
            welcomeText: "Вітаю на на сайті",
        });
    }
    static renderMusicPage(req, res) {
        res.render("my_page/music", {
            title: "Мій сайт",
            text: "Моя улюблена музика — це рок. У цьому стилі є щось особливе: енергія, ритм, емоції, які захоплюють з перших нот. Рок може бути дуже різним — від важкого й потужного хард-року до ліричного і мелодійного софт-року. Мені подобається його багатогранність: іноді хочеться послухати щось більш агресивне й драйвове, а іноді — щось спокійніше, але так само глибоке.Однією з головних причин моєї любові до року є те, як він поєднує в собі музичну складність з простотою людських почуттів. Гітарні рифи, вокал, що пробирає до мурашок, і тексти, які змушують замислитися, — усе це робить рок особливим для мене.",
        });
    }
    static renderCoffeePage(req, res) {
        res.render("my_page/coffee", {
            title: "Мій сайт",
            text: "Моя улюблена кав'ярня — це Starbucks. Кожного разу, коли я заходжу туди, відчуваю особливу атмосферу затишку і комфорту. Люблю їхні ароматні кавові напої, особливо карамельний макіато або класичне латте. Крім смачної кави, мене приваблює можливість просто посидіти з ноутбуком або книгою, насолоджуючись спокійним середовищем.Ще одна річ, яку я ціную в Starbucks, — це різноманіття сезонних пропозицій. Восени завжди чекаю на гарбузовий лате, а взимку — на напої з прянощами. Це місце завжди піднімає настрій і надихає на нові ідеї.",
        });
    }
}
export default MyPageControllers;
